/*
    4.1 以下の2つの変数を定義してください

    1. String型の変数currentYear
        - 値：2023

    2. Int型の変数newYear
        - 値：2024
*/
// この行の下に入力↓




/*
    4.2 4.1で定義したcurrentYearにnewYearを代入して、コンパイルエラーが発生することを確認してください
    ※ 確認して後はコメントアウトしてください
*/
// この行の下に入力↓




/*
4.3 4.1で定義したcurrentYearに"String型に変換した"newYearを代入して、エラーが発生しないことを確認してください。
※ 確認した後はコメントアウトしてください
*/
// この行の下に入力↓




/*
4.4 以下の2つの変数を定義してください

1. Double型の変数number
    - 値：3.3
2. Int型の変数newNumber
    - 値：3
*/
// この行の下に入力↓




/*
4.5 4.4で定義したnumberにnewNumberを代入して、コンパイルエラーが発生することを確認してください
※ 確認して後はコメントアウトしてください
*/
// この行の下に入力↓




/*
4.6 4.5で定義したnumberに"Double型に変換した"newNumberを代入して、エラーが発生しないことを確認してください。
*/
// この行の下に入力↓


